<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="../css/style.css">
    <title>線上二手書局</title>
</head>

<body>
    <?php include('./header.php') ?>
    <div class="about">
        <div class="box1">
            <h2>Motivation</h2>
            <hr width="50px" align=left color="#9393FF" noshade>
            <div class="content1">
                &emsp;&emsp;想必在大家在大學時期都有過一樣的問題吧，就是要為課堂購買參考書或原文書，原文書厚厚的一本，全新的書價錢想當然爾肯定很高，但在入手之後呢？一本最多用兩個學期，最少一個學期，而有些人使用的機會又少之又少，可能整個學期的課結束後，原文書還是宛如全新一樣，根本沒有任何筆記，然後就把他封塵在書架上了，不僅浪費錢也造成紙張不必要的消耗。
                <br>&emsp;&emsp;基於此問題，我們想透過開發大學生線上二手交易網站來解決資源浪費的問題，除此之外，也能讓其他未購書的新生以較低的價格入手課堂所需的參考書或原文書。
                <br>&emsp;&emsp;雖然在目前現有的電子商城有許多涉及二手書的買賣，但除了二手書外，他們也接受其他二手商品的交易，而除了多元商品交易外，他們也難以對商品的品質負責，網路詐騙更是層出不窮。而我們想改善的，除了讓交易內容單一化，還有杜絕詐騙，保障消費者的權益。
            </div>
        </div>
        <div class="box2">
            <h2>Purpose</h2>
            <hr width="50px" align=left color="#9393FF" noshade>
            <div class="content2">
                &emsp;&emsp;首先，業主希望創建一個只銷售二手書的應用程序。因此，我們希望建立一個系統，通過某種系統識別，禁止賣家銷售任何其他種類的產品。由於大多數客戶將是短期客戶，因為目標受眾是學生，業主希望在應用程序中創建一個易於使用和理解的界面。此外，為了讓人更容易記住，這個應用程序的視覺效果應該是相當簡單而專業的。該應用程序應該可以在各種設備上使用，包括筆記本電腦、平板電腦和智能手機，使用戶能夠在任何地方訪問它。為了確保客戶的滿意度，所有的用戶還應該能夠使用該應用程序對他們購買或出售的書籍以及與他們互動的賣家進行評價和評論。
                <br>&emsp;&emsp;對於一個購買和銷售大學二手教科書的在線應用程序來說，最關鍵的系統開發之一是功能。用戶應該能夠在該應用程序的綜合平台上快速而輕鬆地購買和出售二手書。為此，需要一個堅實可靠的數據庫，能夠保存所有關於書籍、其成本和可及性的必要數據。此外，該應用程序需要有一個易於使用的搜索功能，使用戶能夠根據書籍的主題、作者或標題，不費吹灰之力就能找到他們需要的書籍。該應用程序還應該有一個安全的支付網關，使用戶能夠以匿名方式進行交易，而不必擔心欺詐。
                <br>&emsp;&emsp;安全性也是在線二手大學圖書交易應用程序的一個重要係統開發目標。該應用程序應設計有強大的安全功能，以保護用戶數據，包括個人信息和支付細節，免受未經授權的訪問或盜竊。這需要一個安全的登錄和認證系統，在授予用戶訪問該應用程序之前驗證他們的身份。此外，該應用程序應設計有加密和其他安全協議，以保護用戶數據免受黑客和其他惡意行為的影響。
            </div>
        </div>
    </div>
</body>

</html>